Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh95-v4.tmx
Source language: bo
Languages: en

source: །གྲོགས་པོ་དག་གང་ལ་ལ་ཞིག་རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པའི་ཆོས་སྨྲ་བ་ལ་ལེགས་སོ་ཞེས་བྱ་བ་སྦྱིན་པ་དེ་དག་གི་ལས་ཡོངས་སུ་དག་པ་བརྒྱད་འཐོབ་པར་འགྱུར་ཏེ།
en: “Friends, whoever applauds a Dharma teacher expounding this Dharma teaching of The Play in Full will attain eight purities of speech.

source: བདེན་པའི་རྗེས་སུ་འབྲང་བའི་ངག་གི་ལས་ཡོངས་སུ་དག་པས་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱེད་པ་དང་། འཁོར་ཟིལ་གྱིས་གནོན་པས་གཟུང་བར་འོས་པའི་ཚིག་དང་འགལ་བར་མི་བྱེད་པས། བླང་བར་འོས་པའི་ཚིག་དང་། མི་བརླང་བས་སྙན་ཅིང་འཇམ་པའི་ཚིག་དང་། ལུས་དང་སེམས་ཚིམ་པར་བྱེད་པས་ཀ་ལ་པིང་ཀའི་སྒྲ་སྐད་ལྟ་བུ་དང་། སེམས་ཅན་སྡུད་པས་ཚིག་སྙན་པ་དང་། སྒྲ་ཐམས་ཅད་ཟིལ་གྱིས་ནོན་པས་ཚངས་པའི་སྒྲ་ལྟ་བུ་དང་། ཕས་ཀྱི་རྒོལ་བ་ཐམས་ཅད་ཀྱིས་ཟིལ་གྱིས་མི་ནོན་པས་སེང་གེ་བསྒྱིངས་པའི་སྒྲ་ལྟ་བུ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབང་པོ་ཡོངས་སུ་ཚིམ་པར་བྱེད་པས་སངས་རྒྱས་ཀྱི་གསུང་སྟེ།
en: With the pure action of speech that accords with the truth, others will do as one says. With the pure action of speech that overwhelms one’s audience, one’s words will be accepted. With the pure action of not being ignored, one’s words will be heeded. By peacefully gathering beings, one will speak pleasantly and softly. By satisfying bodies and minds, one’s voice will be like the voice of the cuckoo bird. By uniting beings, one will have one’s say. By outshining all voices, one will have a voice like Brahmā. By not being dominated by any propagators of other doctrines, one will have a voice like the roar of a lion. By satisfying the sense faculties of all sentient beings, one will have the voice of a Buddha.

source: ངག་གི་ལས་ཡོངས་སུ་དག་པ་བརྒྱད་པོ་དེ་དག་ཐོབ་པར་འགྱུར་རོ།
en: These are the eight purities of speech that one will attain.

source: །གྲོགས་པོ་དག་གང་ལ་ལ་ཞིག་རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གླེགས་བམ་དུ་བྲིས་ཏེ་འཆང་ངམ། ཀློག་གམ། བསྟི་སྟང་དུ་བྱེད་དམ། བཙུན་པར་བྱེད་དམ། རིམ་གྲོ་བྱེད་དམ། མཆོད་པ་བྱེད་དམ། སེར་སྣ་མེད་པའི་སེམས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་བསྔགས་པ་ཕྱོགས་བཞིར་རྗོད་པ་དང་། ཚུར་ཤོག་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཡི་གེར་བྲིས་ཤིག །ཆོངས་ཤིག །ལྷོགས་ཤིག །སོམས་ཤིག །ཁ་ཏོན་གྱིས་ཤིག་ཅེས་རྗོད་པར་བྱེད་པ་དེ་གཏེར་ཆེན་པོ་བརྒྱད་འཐོབ་པར་འགྱུར་ཏེ།
en: “Friends, whoever puts this Dharma teaching of The Play in Full into writing, and carries, venerates, respects, honors, and pays homage to it while praising this Dharma teaching into the four directions without any feeling of miserliness, saying, ‘Come here! Write this teaching down! Hold it! Pass it on! Reflect on it! Memorize it well!’ they shall attain eight great treasures.

source: བརྗེད་པ་མེད་པས་དྲན་པའི་གཏེར་དང་། བློས་རབ་ཏུ་འབྱེད་པས་བློ་གྲོས་ཀྱི་གཏེར་དང་། མདོ་སྡེ་ཐམས་ཅད་ཀྱི་དོན་གྱི་རྣམ་པ་ཁོང་དུ་ཆུད་པས་རྟོགས་པའི་གཏེར་དང་། ཐོས་པ་ཐམས་ཅད་ཀུན་ཏུ་འཛིན་པས་གཟུངས་ཀྱི་གཏེར་དང་། ལེགས་པར་བཤད་པས་སེམས་ཅན་ཐམས་ཅད་ཚིམ་པར་བྱེད་པས་སྤོབས་པའི་གཏེར་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་སྲུང་བས་ཆོས་ཀྱི་གཏེར་དང་། དཀོན་མཆོག་གསུམ་གྱི་རིགས་རྒྱུན་མི་གཅོད་པས་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་གཏེར་དང་། མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་འཐོབ་པས་སྒྲུབ་པའི་གཏེར་ཏེ།
en: the treasure of unfailing recall because of not forgetting, the treasure of intelligence by careful analysis, the treasure of realization by assimilating enthusiastically the meaning of all the sūtras, the treasure of memorization by remembering everything that one hears, the treasure of confidence by satisfying all sentient beings with good counsel, the treasure of Dharma by preserving the true Dharma, the treasure of the mind of awakening by maintaining the lineage of the Three Jewels, and the treasure of accomplishment by developing receptiveness to the truth of nonorigination.

source: གཏེར་ཆེན་པོ་བརྒྱད་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ།
en: These are the eight great treasures that one will attain.

source: །གྲོགས་པོ་དག་གང་ལ་ལ་ཞིག་གིས་རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ལེགས་པར་བསྟན་ཏེ། འཆད་པ་དེ་ཚོགས་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་ཏེ།
en: “Friends, whoever teaches this Dharma teaching of The Play in Full and explains it will perfect eight accumulations.

source: སེར་སྣའི་སེམས་མེད་པས་སྦྱིན་པའི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། དགེ་བའི་བསམ་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པས། ཚུལ་ཁྲིམས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། ཆགས་པ་མེད་པའི་ཤེས་རབ་ཡང་དག་པར་སྒྲུབ་པའི་ཕྱིར། ཐོས་པའི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པ་ཐམས་ཅད་མངོན་དུ་བྱ་བའི་ཕྱིར། ཞི་གནས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། རིག་པ་གསུམ་གྱིས་རིག་པ་རབ་ཏུ་རྫོགས་པར་བྱ་བའི་ཕྱིར། ལྷག་མཐོང་གི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། མཚན་དང་། དཔེ་བྱད་བཟང་པོ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གི་རྒྱན་ཡོངས་སུ་སྦྱང་བའི་ཕྱིར། བསོད་ནམས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཇི་ལྟར་མོས་པ་བཞིན་དུ་ཚིམ་པར་བྱ་བའི་ཕྱིར། ཡེ་ཤེས་ཀྱི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡོངས་སུ་མི་སྐྱོ་བར་བྱ་བའི་ཕྱིར། སྙིང་རྗེ་ཆེན་པོའི་ཚོགས་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་སྟེ།
en: generosity by being free of miserliness, discipline by perfecting all virtuous intentions, learning by accomplishing unattached knowledge, calm abiding through actualizing all meditative states and equilibriums, insight through perfecting knowledge by means of the threefold knowledge, merit by refining the excellent marks and the adornments of the buddha realms, wisdom by satisfying the inclinations of all sentient beings, and great compassion because of never tiring of ripening all sentient beings.

source: ཚོགས་བརྒྱད་པོ་དེ་དག་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: These are the eight accumulations that one will perfect.

source: གྲོགས་པོ་དག་གང་ལ་ལ་ཞིག་འདི་ལྟ་བུའི་སེམས་དང་ལྡན་ཏེ། འདི་ལྟ་སྟེ། ཇི་ལྟར་སེམས་ཅན་འདི་དག་རྣམ་པ་འདི་ལྟ་བུའི་ཆོས་འདི་ཐོབ་པར་འགྱུར་སྙམ་ནས། རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་གཞན་དག་ལ་རྒྱ་ཆེར་རབ་ཏུ་སྟོན་པར་བྱེད་ན། དེ་དགེ་བའི་རྩ་བ་འདིས་བསོད་ནམས་ཆེན་པོ་བརྒྱད་ཐོབ་པར་འགྱུར་ཏེ།
en: “Friends, whoever has this outlook and, thinking that other sentient beings should receive this instruction, teaches this Dharma teaching of The Play in Full elaborately, will attain eight great forms of merit through this virtuous cause.

source: འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་འཐོབ་པར་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་དང་པོའོ།
en: The first of these eight great types of merit results in becoming a universal monarch.

source: །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱི་བདག་པོ་བྱེད་པར་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་གཉིས་པའོ།
en: The second great merit results in becoming a supreme ruler in the Heaven of the Four Great Kings.

source: །ལྷའི་དབང་པོ་བརྒྱ་བྱིན་དུ་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་གསུམ་པའོ།
en: The third great merit results in becoming Śakra, lord of the gods.

source: །ལྷའི་བུ་རབ་འཐབ་བྲལ་དུ་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་བཞི་པའོ།
en: The fourth great merit results in becoming the god Suyāma.

source: །ཡོངས་སུ་དགའ་ལྡན་དུ་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་ལྔ་པའོ།
en: The fifth great merit results in becoming Santuṣita.

source: །རབ་འཕྲུལ་དུ་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་དྲུག་པའོ།
en: The sixth great merit results in becoming Sunirmāṇarati.

source: །ལྷའི་རྒྱལ་པོ་དབང་སྒྱུར་དུ་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་བདུན་པའོ།
en: The seventh great merit results in becoming Vaśavartin, the king of gods.

source: །ཚངས་པ་ཆེན་པོའི་ཚངས་པར་འགྱུར་བ་འདི་ནི་བསོད་ནམས་ཆེན་པོ་བརྒྱད་པའོ།
en: The eighth great merit results in becoming Brahmā from the Mahā-Brahmā Heaven.

source: །ཐ་མར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་དགེ་བའི་ཆོས་ཐམས་ཅད་སྤངས་ནས། དགེ་བའི་ཆོས་ཐམས་ཅད་དང་ལྡན་པར་ཡང་འགྱུར་ཏེ།
en: Finally one becomes a thus-gone one, a worthy one, a perfectly awakened one, free from all unvirtuous dharmas and endowed with all the virtuous ones.

source: བསོད་ནམས་ཆེན་པོ་བརྒྱད་པོ་དེ་དག་འཐོབ་པར་འགྱུར་རོ།
en: These are the eight great merits that one will attain.

source: །གྲོགས་པོ་དག་གང་ལ་ལ་ཞིག་རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཆད་པ་ན་རྣ་བ་བླགས་ཏེ། ཉན་པར་འགྱུར་བ་དེ་སེམས་དྲི་མ་མེད་པ་བརྒྱད་འཐོབ་པར་འགྱུར་ཏེ། བརྒྱད་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: “Friends, whoever listens attentively to this Dharma teaching of The Play in Full as it is being explained will gain eight pure mind states. What are these eight? They are:

source: ཞེ་སྡང་ཐམས་ཅད་གཞོམ་པའི་ཕྱིར། བྱམས་པ་ཐོབ་པར་འགྱུར་བ་དང་། རྣམ་པར་འཚེ་བ་ཐམས་ཅད་དོར་བའི་ཕྱིར། སྙིང་རྗེ་ཐོབ་པར་འགྱུར་བ་དང་། མི་དགའ་བ་ཐམས་ཅད་བསལ་བའི་ཕྱིར། དགའ་བ་ཐོབ་པར་འགྱུར་བ་དང་། རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དོར་བའི་ཕྱིར། བཏང་སྙོམས་ཐོབ་པར་འགྱུར་བ་དང་། འདོད་པའི་ཁམས་ཐམས་ཅད་ལ་དབང་བསྒྱུར་བར་བྱ་བའི་ཕྱིར། བསམ་གཏན་བཞི་ཐོབ་པར་འགྱུར་བ་དང་། སེམས་ལ་དབང་བསྒྱུར་བར་བྱ་བའི་ཕྱིར། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཐོབ་པར་འགྱུར་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དུ་འགྲོ་བ་དང་འོང་བར་བྱ་བའི་ཕྱིར། མངོན་པར་ཤེས་པ་ལྔ་ཐོབ་པར་འགྱུར་བ་དང་། དཔའ་བར་འགྲོ་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པར་བྱ་བའི་ཕྱིར། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ཡང་དག་པར་གཞོམ་པ་ཐོབ་པར་འགྱུར་བ་སྟེ།
en: love in order to conquer all anger, compassion in order to abandon all ill will, sympathetic joy in order to clear away all depression, equanimity in order to abandon desire and anger, the four concentrations in order to master the entire desire realm, the four equilibriums of the formless realm in order to master the mind, the five types of higher knowledge in order to travel to other buddha realms, and the ability to conquer all traces of habitual tendencies in order to attain the meditative concentration of the heroic gait.

source: སེམས་དྲི་མ་མེད་པ་བརྒྱད་པོ་དེ་དག་ཐོབ་པར་འགྱུར་རོ། །
en: These are the eight pure mind states that one will attain.

source: གྲོགས་པོ་དག་གྲོང་ངམ། གྲོང་ཁྱེར་རམ། གྲོང་རྡལ་ལམ། ལྗོངས་སམ། ལྗོངས་ཀྱི་ཕྱོགས་སམ། འཆག་ས་འམ། གཙུག་ལག་ཁང་གང་དུ་རྒྱ་ཆེར་རོལ་པའི་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་སྤྱོད་པར་འགྱུར་བ་དེར་སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མ་གཏོགས་པར་འཇིགས་པ་བརྒྱད་འབྱུང་བར་མི་འགྱུར་རོ།
en: “Friends, wherever this Dharma teaching of The Play in Full is found, whether in a village, a city, a market, an inhabited place, a district, a courtyard, or a temple, the eight fears will not manifest except from the ripening of past actions.

source: རྒྱལ་པོས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། ཆོམ་རྐུན་གྱིས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། སྦྲུལ་གྱིས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། མུ་གེའི་དགོན་པས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། ཕན་ཚུན་འཐབ་པ་དང་། རྩོད་པ་དང་། འགྱེད་པ་དང་། མཚང་འདྲུ་བས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། ལྷས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། ཀླུས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། གནོད་སྦྱིན་ལ་སོགས་པས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་དང་། གཙེ་བ་ཐམས་ཅད་ཀྱིས་དཀྲུགས་པའི་འཇིགས་པ་འབྱུང་བར་མི་འགྱུར་བ་སྟེ།
en: the fears of the troubles caused by (1) rulers, (2) thieves, (3) malicious beings, (4) starvation in a wilderness, (5) fights, quarrels and disputes, (6) gods, (7) nāgas, (8) yakṣas, and all types of misfortune.

source: སྔོན་གྱི་ལས་ཀྱི་རྣམ་པར་སྨིན་པ་མ་གཏོགས་པར་གྲོགས་པོ་དག་འཇིགས་པ་བརྒྱད་པོ་དེ་དག་འབྱུང་བར་མི་འགྱུར་རོ།
en: Other than the ripening of previous actions, my friends, these eight fears will no longer occur.

source: །གྲོགས་པོ་དག་མདོར་ན་གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་བསྐལ་པར་བཞུགས་ལ་ཉིན་མཚན་དུ་རྒྱུན་མི་འཆད་པར་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་བསྔགས་པ་བརྗོད་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདིའི་བསྔགས་པ་མཐར་ཐུག་པར་ཡང་མི་འགྱུར་ལ། དེ་བཞིན་གཤེགས་པའི་སྤོབས་པ་ཡང་ཟད་པར་མི་འགྱུར་རོ།
en: “Friends, in short, even if the lifespan of the Thus-Gone One were to last for an eon, and even if he were to praise this Dharma teaching uninterruptedly day and night, he would not be able to end his praise of this Dharma teaching, and his inspired speech would still continue.

source: །གྲོགས་པོ་དག་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་དང་། ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་དང་། རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་མཐོང་བ་ཚད་མེད་ཅིང་ཐུག་པ་མེད་པ་དེ་བཞིན་དུ་གྲོགས་པོ་དག་གང་ཆོས་རྒྱ་ཆེན་པོ་འདི་ལྟ་བུ་འདི་སེམས་ཅན་འདི་དག་གིས་ཇི་ལྟར་ཐོབ་པར་འགྱུར་སྙམ་པའི་སེམས་འདིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཡི་གེར་འདྲི་བའམ། ཡི་གེར་འདྲིར་འཇུག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། འཁོར་གྱི་ནང་དུ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པར་འགྱུར་བ་དེ་དག་གིས་བསོད་ནམས་ཀྱང་ཐུག་པ་མེད་དོ།
en: “Friends, the discipline, absorption, knowledge, liberation, and wisdom vision of liberation of the Thus-Gone One is immeasurable and boundless. For this reason, my friends, if anyone develops the wish that others receive this vast teaching, and subsequently memorizes this Dharma teaching, carries it, propagates it, writes it down, or commissions it to be written, comprehends it, and teaches it elaborately to his congregation, then their merit shall also be boundless.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་ལ་བཀའ་སྩལ་པ།
en: Then the Thus-Gone One announced to venerable Mahākāśyapa, venerable Ānanda, and the bodhisattva great being Maitreya:

source: གྲོགས་པོ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ངས་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་ཡང་དག་པར་བསྒྲུབས་པ་འདི་ཁྱེད་ཀྱི་ལག་ཏུ་གཏད་དེ། ཡོངས་སུ་གཏད་པའི་མཆོག་གིས་གཏད་དོ།
en: “Friends, the unsurpassable and perfect awakening that I have accomplished through limitless billions of eons, I now place in your hands. I entrust you with a supreme entrustment.

source: །ཁྱེད་བདག་ཉིད་ཀྱིས་ཀྱང་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་ཟུང་ཤིག །གཞན་དག་ལ་ཡང་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་ཅིག །དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས།
en: Now you should keep this teaching with you and teach it elaborately to others.”

source: དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་ཀྱི་རྣམ་གྲངས་འདི་རྒྱ་ཆེར་ཡོངས་སུ་གཏད་པའི་ཕྱིར། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་ཀྱང་བཀའ་སྩལ་ཏོ།
en: When he had said this, the Blessed One uttered the following verses in order to pass on his Dharma teaching more fully:

source: །སངས་རྒྱས་གཟིགས་པས་སེམས་ཅན་གང་དག་ངས་མཐོང་བ།
en: “If the beings whom I see with my buddha-eye

source: །དེ་དག་ཤཱ་རིའི་བུ་འདྲར་དགྲ་བཅོམ་པར་གྱུར་ལ།
en: Were all worthy ones equal to Śāriputra,

source: །གལ་ཏེ་ལ་ལས་གང་གཱའི་ཀླུང་གི་བྱེ་སྙེད་ཀྱི། །བསྐལ་པ་བྱེ་བར་དེ་དག་རྣམས་ལའང་མཆོད་བྱེད་ལ། །གང་ཞིག་ཉིན་ཞག་གཅིག་ཏུ་རབ་ཏུ་དགའ་བ་ཡིས། །རང་སངས་རྒྱས་རྣམས་ལ་ནི་ཕྲེང་བ་དེ་བཞིན་དུ། ། གཞན་ཡང་རྣམ་པ་མཆོག་རྣམས་ཀྱིས་ནི་མཆོད་བྱེད་ན། །དེ་བས་བསོད་ནམས་བྱས་པ་འདི་ནི་ཁྱད་པར་འཕགས།
en: And if someone would make, for millions of eons, Offerings to them, equal in number to sand grains in the Ganges, “The merit of this would be surpasse If one would joyfully make offerings of garlands and the like To a single solitary buddha, Even for just a single day and night.

source: །གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་རང་རྒྱལ་ཐོབ་གྱུར་ལ།
en: “If all sentient beings were solitary buddhas,

source: །དེ་དག་རྣམས་ལ་གང་ཞིག་འདིར་ནི་བག་ཡོད་པར།
en: And someone were to offer with great attention

source: །བསྐལ་པ་དུ་མར་ཟས་དང་སྐོམ་དང་བགོ་བ་དང་། །མེ་ཏོག་སྤོས་དང་བྱུག་པ་རྣམས་ཀྱིས་མཆོད་བྱེད་ལ།
en: Flowers, perfumes, and ointments Continually over several eons,

source: །གང་ཞིག་གིས་ནི་དེ་བཞིན་གཤེགས་པ་གཅིག་ཅིག་ལ། །ལན་ཅིག་ཕྱག་འཚལ་བྱེད་ཅིང་དང་བའི་སེམས་ཀྱིས་ནི། །དགྲ་བཅོམ་པ་ལ་ཕྱག་འཚལ་ལོ་ཞེས་ཚིག་བརྗོད་ན། ། དེ་བས་བསོད་ནམས་འདི་ནི་ཤིན་ཏུ་ཆེས་མཆོག་གོ།
en: “That merit would be greatly surpassed If someone were to offer a single thus-gone one A single prostration accompanied by a devoted attitude And say, ‘Homage to the Worthy One!’

source: །གལ་ཏེ་སེམས་ཅན་ཐམས་ཅད་སངས་རྒྱས་ཐོབ་གྱུར་ལ།
en: “If all sentient beings were buddhas,

source: །དེ་དག་རྣམས་ལ་གང་ཞིག་སྔར་བཞིན་མཆོད་བྱེད་ཅིང་། །ལྷ་ཡི་མེ་ཏོག་རྣམས་དང་མི་ཡི་མཆོག་རྣམས་དང་། །རྣམ་པ་མང་པོས་བསྐལ་པ་དུ་མར་མཆོད་བྱེད་ལ། །གང་ཞིག་དམ་པའི་ཆོས་ནི་རྣམ་པར་འཇིག་པའི་ཚེ། །རང་གི་ལུས་དང་དེ་བཞིན་སྲོག་ཀྱང་བཏང་ནས་ནི། །ཞག་གཅིག་བར་དུ་མདོ་སྡེ་འདི་ནི་འཛིན་བྱེད་ན། །བསོད་ནམས་འདི་ནི་དེ་བས་ཁྱད་པར་འཕགས་པར་འགྱུར།
en: And someone were to worship as just explained, With divine flowers and the most precious flowers of this world, For many eons, with many kinds of offerings, “That merit would be greatly surpassed If someone, at the time when the sacred Dharma is degenerating, Gives up concern for his body and life And recites this sūtra for a single day and night.

source: །གང་ཞིག་རྣམ་པར་འདྲེན་པ་རྣམས་དང་རང་རྒྱལ་དང་། །དེ་བཞིན་ཉན་ཐོས་རྣམས་ལ་མཆོད་པ་བྱེད་འདོད་པ།
en: “Whoever wishes to venerate the guides, And likewise the solitary buddhas and the listeners,

source: །དེ་ཡིས་བྱང་ཆུབ་སེམས་ནི་བརྟན་པོར་བསྐྱེད་བྱས་ཏེ།
en: Should give steady rise to the mind of awakening

source: །མདོ་སྡེ་འདི་ནི་རྟག་པར་རབ་ཏུ་གཟུང་བར་བྱ། །
en: And always keep this sūtra firmly in mind.

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་བྱུང་གང་ཡིན་པ། །འདི་ནི་ལེགས་པར་བཤད་པ་ཀུན་གྱི་རྒྱལ་པོ་ཡིན།
en: “This is the king of all good advice Given by all thus-gone ones.

source: །མདོ་སྡེ་དཀོན་མཆོག་འདི་ནི་གང་ན་གནས་འགྱུར་བ།
en: Wherever this jewel of a sūtra is found,

source: །དེ་ཡི་ཁྱིམ་དུ་དེ་བཞིན་གཤེགས་པ་རྟག་ཏུ་གནས།
en: In that house the Thus-Gone One always resides.

source: །གང་གིས་མདོ་འདི་ཕ་རོལ་དག་ལ་བྱིན་པ་དང་། །ཚིག་གཅིག་བརྗོད་པ་དེ་ཡང་བསྐལ་པ་བྱེ་བར་ནི། །ཚིག་འབྲུ་རྣམས་ལས་མི་ཉམས་དོན་ལས་ཉམས་མི་འགྱུར།
en: “Whoever gives this sūtra to others or recites just a single word, For millions of eons he shall never stray Either from its words or its meaning,

source: །སྤོབས་པ་དགེ་བ་མཐའ་ཡས་པ་དག་འཐོབ་པར་འགྱུར།
en: And thus attain limitless eloquence and virtue.

source: །གང་ཞིག་ཆོས་འདི་ཐོས་ནས་རབ་ཏུ་སྒྲུབ་བྱེད་པ།
en: “Whoever hears this teaching and puts it into practice

source: །དེ་ནི་མི་ཡི་འདྲེན་པ་མ་གཏོགས་འོག་ཏུ་ནི།
en: Shall not only be an unsurpassable guide of humans,

source: །དེ་འདྲ་བ་ཡི་སེམས་ཅན་གང་ཡང་ཡོད་མ་ཡིན།
en: But a being without equal,

source: །དེ་ནི་རྒྱ་མཚོ་ལྟ་བུར་ཟད་མི་ཤེས་པར་འགྱུར།
en: Inexhaustible like the ocean.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས། ལྷའི་བུ་དབང་ཕྱུག་ཆེན་པོ་ལ་སོགས་པ་གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་དང་། བྱམས་པ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་དང་། འོད་སྲུང་ཆེན་པོ་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་ཐམས་ཅད་དང་། ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། དྲི་ཟར་བཅས་པའི་འཇིག་རྟེན་ཡི་རངས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པ་ལ་མངོན་པར་བསྟོད་དོ།
en: When the Blessed One, the Exalted Lord, had spoken, the gods from the pure realms headed by Maheśvara; all the bodhisattvas, the great beings, headed by Maitreya; the great listeners headed by Mahākāśyapa; and the entire world with its gods, humans, demigods, and gandharvas rejoiced at the Blessed One’s teaching.

source: །མཇུག་སྡུད་པའི་ལེའུ་ཞེས་བྱ་བ་སྟེ། ཉི་ཤུ་རྩ་བདུན་པའོ།། །།འཕགས་པ་རྒྱ་ཆེར་རོལ་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ་རྫོགས་སྷོ།། །།
en: This concludes the twenty-seventh chapter, the epilogue. This completes the Noble Great Vehicle Sūtra, “The Play in Full.”

source: རྒྱ་གར་གྱི་མཁན་པོ་ཛི་ན་མི་ཏྲ་དང་། དཱ་ན་ཤཱི་ལ་དང་། མུ་ནི་བར་མ་དང་། ཞུ་ཆེན་གྱི་ལོཙྪ་བ་བན་དེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ། སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ནས་གཏན་ལ་ཕབ་པ།། །།
en: This was taught and translated by the Indian preceptors Jinamitra, Dānaśīla, and Munivarman, and the translator-editor Bandé Yeshé Dé, who proofed and finalized the translation.
